Zer0221/Embedded_Software_Architecture/drivers/protocol/security/stm32_security.c
/**
 * @file stm32_security.c
 * @brief STM32平台安全模块实现
 *
 * 该文件实现了STM32平台上的安全模块功能，包括加�?解密、哈希计算、安全启动和固件验证等功�?
 */

#include <string.h>
#include "feature/security_api.h"

/* STM32 HAL 加密库头文件 */
#include "stm32_hal_crypto.h" /* 根据实际STM32平台库头文件调整 */

/* 安全设备上下�?*/
typedef struct {
    uint8_t initialized;
    security_callback_t callback;
    void *callback_arg;
    security_status_t status;
    /* STM32硬件加密引擎句柄 */
    CRYP_HandleTypeDef hcryp;
    /* STM32硬件哈希引擎句柄 */
    HASH_HandleTypeDef hhash;
    /* STM32 PKA (Public Key Accelerator) 句柄 */
    PKA_HandleTypeDef hpka;
    /* 当前操作配置 */
    security_config_t current_config;
} stm32_security_ctx_t;

/* 全局设备上下�?*/
static stm32_security_ctx_t g_security_ctx;

/* 密钥存储�?*/
#define MAX_KEY_STORAGE 10
typedef struct {
    uint8_t used;
    uint32_t id;
    security_key_type_t type;
    uint16_t size;
    uint8_t data[256]; /* 根据需要调整大�?*/
} key_storage_t;

static key_storage_t g_key_storage[MAX_KEY_STORAGE];

/* 加密操作互斥�?*/
static volatile uint8_t g_security_mutex;

/* 获取互斥�?*/
static int security_lock(void)
{
    if (g_security_mutex) {
        return -1;
    }
    g_security_mutex = 1;
    return 0;
}

/* 释放互斥�?*/
static void security_unlock(void)
{
    g_security_mutex = 0;
}

/**
 * @brief 查找密钥存储�?
 * 
 * @param key_id 密钥ID
 * @return int 存储索引�?1表示未找�?
 */
static int find_key_storage(uint32_t key_id)
{
    for (int i = 0; i < MAX_KEY_STORAGE; i++) {
        if (g_key_storage[i].used && g_key_storage[i].id == key_id) {
            return i;
        }
    }
    return -1;
}

/**
 * @brief 分配密钥存储�?
 * 
 * @param key_id 密钥ID
 * @return int 存储索引�?1表示无可用空�?
 */
static int alloc_key_storage(uint32_t key_id)
{
    int idx = find_key_storage(key_id);
    if (idx >= 0) {
        return idx; /* 已存�?*/
    }
    
    for (int i = 0; i < MAX_KEY_STORAGE; i++) {
        if (!g_key_storage[i].used) {
            g_key_storage[i].used = 1;
            g_key_storage[i].id = key_id;
            return i;
        }
    }
    return -1; /* 没有可用空间 */
}

/**
 * @brief STM32平台安全模块初始�?
 */
int security_init(security_callback_t callback, void *arg, security_handle_t *handle)
{
    if (g_security_ctx.initialized) {
        *handle = (security_handle_t)&g_security_ctx;
        return 0; /* 已初始化 */
    }
    
    /* 初始化上下文 */
    memset(&g_security_ctx, 0, sizeof(g_security_ctx));
    g_security_ctx.callback = callback;
    g_security_ctx.callback_arg = arg;
    g_security_ctx.status = SECURITY_STATUS_IDLE;
    
    /* 初始化密钥存�?*/
    memset(g_key_storage, 0, sizeof(g_key_storage));
    
    /* 初始化互斥锁 */
    g_security_mutex = 0;
    
    /* 初始化STM32 HAL加密模块 */
    __HAL_RCC_CRYP_CLK_ENABLE();
    __HAL_RCC_HASH_CLK_ENABLE();
    __HAL_RCC_PKA_CLK_ENABLE();
    
    /* 初始化加密引�?*/
    g_security_ctx.hcryp.Instance = CRYP;
    g_security_ctx.hcryp.Init.DataType = CRYP_DATATYPE_8B;
    g_security_ctx.hcryp.Init.KeySize = CRYP_KEYSIZE_128B;
    g_security_ctx.hcryp.Init.pKey = NULL;
    g_security_ctx.hcryp.Init.Algorithm = CRYP_AES_ECB;
    g_security_ctx.hcryp.Init.DataWidthUnit = CRYP_DATAWIDTHUNIT_BYTE;
    HAL_CRYP_Init(&g_security_ctx.hcryp);
    
    /* 初始化哈希引�?*/
    g_security_ctx.hhash.Init.DataType = HASH_DATATYPE_8B;
    HAL_HASH_Init(&g_security_ctx.hhash);
    
    /* 初始化PKA */
    HAL_PKA_Init(&g_security_ctx.hpka);
    
    g_security_ctx.initialized = 1;
    *handle = (security_handle_t)&g_security_ctx;
    
    return 0;
}

/**
 * @brief STM32平台安全模块去初始化
 */
int security_deinit(security_handle_t handle)
{
    stm32_security_ctx_t *ctx = (stm32_security_ctx_t *)handle;
    
    if (!ctx || !ctx->initialized) {
        return -1;
    }
    
    /* 确保没有正在进行的操�?*/
    if (ctx->status == SECURITY_STATUS_BUSY) {
        return -1;
    }
    
    /* 释放STM32 HAL加密模块资源 */
    HAL_CRYP_DeInit(&ctx->hcryp);
    HAL_HASH_DeInit(&ctx->hhash);
    HAL_PKA_DeInit(&ctx->hpka);
    
    __HAL_RCC_CRYP_CLK_DISABLE();
    __HAL_RCC_HASH_CLK_DISABLE();
    __HAL_RCC_PKA_CLK_DISABLE();
    
    /* 清空密钥存储 */
    memset(g_key_storage, 0, sizeof(g_key_storage));
    
    /* 清空上下�?*/
    memset(ctx, 0, sizeof(stm32_security_ctx_t));
    
    return 0;
}

/**
 * @brief 生成随机�?
 */
int security_generate_random(security_handle_t handle, uint8_t *buffer, uint32_t len)
{
    stm32_security_ctx_t *ctx = (stm32_security_ctx_t *)handle;
    
    if (!ctx || !ctx->initialized || !buffer || len == 0) {
        return -1;
    }
    
    if (security_lock() != 0) {
        return -1;
    }
    
    /* 使用STM32的RNG模块生成随机�?*/
    RNG_HandleTypeDef hrng;
    hrng.Instance = RNG;
    
    HAL_RNG_Init(&hrng);
    
    uint32_t random;
    for (uint32_t i = 0; i < len; i++) {
        if (i % 4 == 0) {
            if (HAL_RNG_GenerateRandomNumber(&hrng, &random) != HAL_OK) {
                security_unlock();
                return -1;
            }
        }
        buffer[i] = (uint8_t)(random >> ((i % 4) * 8));
    }
    
    HAL_RNG_DeInit(&hrng);
    security_unlock();
    
    return 0;
}

/**
 * @brief 生成密钥
 */
int security_generate_key(security_handle_t handle, security_key_type_t key_type, 
                         security_algo_t algo, uint16_t key_size, 
                         uint8_t *key_buffer, uint32_t *key_len)
{
    stm32_security_ctx_t *ctx = (stm32_security_ctx_t *)handle;
    
    if (!ctx || !ctx->initialized || !key_buffer || !key_len || 
        *key_len < (key_size / 8)) {
        return -1;
    }
    
    if (security_lock() != 0) {
        return -1;
    }
    
    /* 根据算法和密钥类型生成密�?*/
    int result = 0;
    
    switch (algo) {
        case SECURITY_ALGO_AES:
            if (key_type != SECURITY_KEY_SYMMETRIC) {
                result = -1;
                break;
            }
            /* 生成AES密钥 */
            if (security_generate_random(handle, key_buffer, key_size / 8) != 0) {
                result = -1;
            } else {
                *key_len = key_size / 8;
            }
            break;
            
        case SECURITY_ALGO_RSA:
            /* 生成RSA密钥�?- 这里只是简化示�?*/
            if (key_type == SECURITY_KEY_PRIVATE || key_type == SECURITY_KEY_PUBLIC) {
                /* 在实际应用中，应该使用STM32 PKA模块或外部库生成RSA密钥�?*/
                /* 为简化示例，这里只生成随机数�?*/
                if (security_generate_random(handle, key_buffer, key_size / 8) != 0) {
                    result = -1;
                } else {
                    *key_len = key_size / 8;
                }
            } else {
                result = -1;
            }
            break;
            
        case SECURITY_ALGO_ECC:
            /* 生成ECC密钥�?- 这里只是简化示�?*/
            if (key_type == SECURITY_KEY_PRIVATE || key_type == SECURITY_KEY_PUBLIC) {
                /* 在实际应用中，应该使用STM32 PKA模块生成ECC密钥�?*/
                /* 为简化示例，这里只生成随机数�?*/
                if (security_generate_random(handle, key_buffer, key_size / 8) != 0) {
                    result = -1;
                } else {
                    *key_len = key_size / 8;
                }
            } else {
                result = -1;
            }
            break;
            
        default:
            result = -1;
            break;
    }
    
