Zer0221/Embedded_Software_Architecture/drivers/protocol/security/stm32_security.c
    security_unlock();
    return result;
}

/**
 * @brief 导入密钥
 */
int security_import_key(security_handle_t handle, security_key_type_t key_type, 
                       uint32_t key_id, const uint8_t *key_data, uint32_t key_len)
{
    stm32_security_ctx_t *ctx = (stm32_security_ctx_t *)handle;
    
    if (!ctx || !ctx->initialized || !key_data || key_len == 0 || 
        key_len > sizeof(g_key_storage[0].data)) {
        return -1;
    }
    
    if (security_lock() != 0) {
        return -1;
    }
    
    int idx = alloc_key_storage(key_id);
    if (idx < 0) {
        security_unlock();
        return -1;
    }
    
    g_key_storage[idx].type = key_type;
    g_key_storage[idx].size = key_len * 8; /* 转换为位 */
    memcpy(g_key_storage[idx].data, key_data, key_len);
    
    security_unlock();
    return 0;
}

/**
 * @brief 导出密钥
 */
int security_export_key(security_handle_t handle, uint32_t key_id, 
                       uint8_t *key_data, uint32_t *key_len)
{
    stm32_security_ctx_t *ctx = (stm32_security_ctx_t *)handle;
    
    if (!ctx || !ctx->initialized || !key_data || !key_len) {
        return -1;
    }
    
    if (security_lock() != 0) {
        return -1;
    }
    
    int idx = find_key_storage(key_id);
    if (idx < 0) {
        security_unlock();
        return -1;
    }
    
    uint32_t size = g_key_storage[idx].size / 8; /* 转换为字�?*/
    if (*key_len < size) {
        security_unlock();
        return -1;
    }
    
    memcpy(key_data, g_key_storage[idx].data, size);
    *key_len = size;
    
    security_unlock();
    return 0;
}

/**
 * @brief 删除密钥
 */
int security_delete_key(security_handle_t handle, uint32_t key_id)
{
    stm32_security_ctx_t *ctx = (stm32_security_ctx_t *)handle;
    
    if (!ctx || !ctx->initialized) {
        return -1;
    }
    
    if (security_lock() != 0) {
        return -1;
    }
    
    int idx = find_key_storage(key_id);
    if (idx < 0) {
        security_unlock();
        return -1;
    }
    
    /* 安全擦除密钥数据 */
    memset(&g_key_storage[idx], 0, sizeof(key_storage_t));
    
    security_unlock();
    return 0;
}

/**
 * @brief 配置加密引擎
 */
static int config_crypto_engine(stm32_security_ctx_t *ctx, const security_config_t *config, uint32_t key_id)
{
    int idx = find_key_storage(key_id);
    if (idx < 0) {
        return -1;
    }
    
    /* 配置加密算法和模�?*/
    switch (config->algo) {
        case SECURITY_ALGO_AES:
            switch (config->mode) {
                case SECURITY_MODE_ECB:
                    ctx->hcryp.Init.Algorithm = CRYP_AES_ECB;
                    break;
                case SECURITY_MODE_CBC:
                    ctx->hcryp.Init.Algorithm = CRYP_AES_CBC;
                    break;
                case SECURITY_MODE_CTR:
                    ctx->hcryp.Init.Algorithm = CRYP_AES_CTR;
                    break;
                case SECURITY_MODE_GCM:
                    ctx->hcryp.Init.Algorithm = CRYP_AES_GCM;
                    break;
                case SECURITY_MODE_CCM:
                    ctx->hcryp.Init.Algorithm = CRYP_AES_CCM;
                    break;
                default:
                    return -1;
            }
            
            /* 配置密钥大小 */
            switch (g_key_storage[idx].size) {
                case 128:
                    ctx->hcryp.Init.KeySize = CRYP_KEYSIZE_128B;
                    break;
                case 192:
                    ctx->hcryp.Init.KeySize = CRYP_KEYSIZE_192B;
                    break;
                case 256:
                    ctx->hcryp.Init.KeySize = CRYP_KEYSIZE_256B;
                    break;
                default:
                    return -1;
            }
            
            /* 设置密钥 */
            ctx->hcryp.Init.pKey = g_key_storage[idx].data;
            
            /* 设置初始化向�?*/
            if (config->mode != SECURITY_MODE_ECB) {
                if (!config->iv || config->iv_len < 16) {
                    return -1;
                }
                ctx->hcryp.Init.pInitVect = config->iv;
            }
            
            /* 重新初始化加密引�?*/
            if (HAL_CRYP_DeInit(&ctx->hcryp) != HAL_OK) {
                return -1;
            }
            
            if (HAL_CRYP_Init(&ctx->hcryp) != HAL_OK) {
                return -1;
            }
            
            break;
            
        default:
            return -1;
    }
    
    return 0;
}

/**
 * @brief 加密数据
 */
int security_encrypt(security_handle_t handle, const security_config_t *config, 
                    uint32_t key_id, const uint8_t *input, uint32_t input_len,
                    uint8_t *output, uint32_t *output_len)
{
    stm32_security_ctx_t *ctx = (stm32_security_ctx_t *)handle;
    
    if (!ctx || !ctx->initialized || !config || !input || !output || !output_len ||
        input_len == 0 || *output_len < input_len) {
        return -1;
    }
    
    if (security_lock() != 0) {
        return -1;
    }
    
    int result = 0;
    ctx->status = SECURITY_STATUS_BUSY;
    
    /* 配置加密引擎 */
    if (config_crypto_engine(ctx, config, key_id) != 0) {
        ctx->status = SECURITY_STATUS_ERROR;
        security_unlock();
        return -1;
    }
    
    /* 执行加密操作 */
    HAL_StatusTypeDef status;
    switch (config->algo) {
        case SECURITY_ALGO_AES:
            /* 处理GCM/CCM模式下的AAD数据 */
            if ((config->mode == SECURITY_MODE_GCM || config->mode == SECURITY_MODE_CCM) &&
                config->aad && config->aad_len > 0) {
                status = HAL_CRYPEx_AESGCM_SetHeaderPhase(&ctx->hcryp, config->aad, config->aad_len, TIMEOUT_VALUE);
                if (status != HAL_OK) {
                    result = -1;
                    break;
                }
            }
            
            /* 执行加密 */
            status = HAL_CRYP_Encrypt(&ctx->hcryp, (uint32_t *)input, input_len, (uint32_t *)output, TIMEOUT_VALUE);
            if (status != HAL_OK) {
                result = -1;
            } else {
                *output_len = input_len;
            }
            break;
            
        default:
            result = -1;
            break;
    }
    
    if (result == 0) {
        ctx->status = SECURITY_STATUS_COMPLETE;
    } else {
        ctx->status = SECURITY_STATUS_ERROR;
    }
    
