Zer0221/Embedded_Software_Architecture/drivers/protocol/security/stm32_security.c
    security_unlock();
    
    /* 调用回调函数 */
    if (ctx->callback) {
        ctx->callback(ctx->callback_arg, ctx->status);
    }
    
    return result;
}

/**
 * @brief 解密数据
 */
int security_decrypt(security_handle_t handle, const security_config_t *config, 
                    uint32_t key_id, const uint8_t *input, uint32_t input_len,
                    uint8_t *output, uint32_t *output_len)
{
    stm32_security_ctx_t *ctx = (stm32_security_ctx_t *)handle;
    
    if (!ctx || !ctx->initialized || !config || !input || !output || !output_len ||
        input_len == 0 || *output_len < input_len) {
        return -1;
    }
    
    if (security_lock() != 0) {
        return -1;
    }
    
    int result = 0;
    ctx->status = SECURITY_STATUS_BUSY;
    
    /* 配置解密引擎 */
    if (config_crypto_engine(ctx, config, key_id) != 0) {
        ctx->status = SECURITY_STATUS_ERROR;
        security_unlock();
        return -1;
    }
    
    /* 执行解密操作 */
    HAL_StatusTypeDef status;
    switch (config->algo) {
        case SECURITY_ALGO_AES:
            /* 处理GCM/CCM模式下的AAD数据 */
            if ((config->mode == SECURITY_MODE_GCM || config->mode == SECURITY_MODE_CCM) &&
                config->aad && config->aad_len > 0) {
                status = HAL_CRYPEx_AESGCM_SetHeaderPhase(&ctx->hcryp, config->aad, config->aad_len, TIMEOUT_VALUE);
                if (status != HAL_OK) {
                    result = -1;
                    break;
                }
            }
            
            /* 执行解密 */
            status = HAL_CRYP_Decrypt(&ctx->hcryp, (uint32_t *)input, input_len, (uint32_t *)output, TIMEOUT_VALUE);
            if (status != HAL_OK) {
                result = -1;
            } else {
                *output_len = input_len;
            }
            break;
            
        default:
            result = -1;
            break;
    }
    
    if (result == 0) {
        ctx->status = SECURITY_STATUS_COMPLETE;
    } else {
        ctx->status = SECURITY_STATUS_ERROR;
    }
    
    security_unlock();
    
    /* 调用回调函数 */
    if (ctx->callback) {
        ctx->callback(ctx->callback_arg, ctx->status);
    }
    
    return result;
}

/**
 * @brief 配置哈希引擎
 */
static int config_hash_engine(stm32_security_ctx_t *ctx, security_hash_t hash_type)
{
    /* 配置哈希算法 */
    switch (hash_type) {
        case SECURITY_HASH_MD5:
            ctx->hhash.Init.Algorithm = HASH_ALGOSELECTION_MD5;
            break;
        case SECURITY_HASH_SHA1:
            ctx->hhash.Init.Algorithm = HASH_ALGOSELECTION_SHA1;
            break;
        case SECURITY_HASH_SHA224:
            ctx->hhash.Init.Algorithm = HASH_ALGOSELECTION_SHA224;
            break;
        case SECURITY_HASH_SHA256:
            ctx->hhash.Init.Algorithm = HASH_ALGOSELECTION_SHA256;
            break;
        default:
            return -1;
    }
    
    /* 重新初始化哈希引�?*/
    if (HAL_HASH_DeInit(&ctx->hhash) != HAL_OK) {
        return -1;
    }
    
    if (HAL_HASH_Init(&ctx->hhash) != HAL_OK) {
        return -1;
    }
    
    return 0;
}

/**
 * @brief 计算哈希�?
 */
int security_hash(security_handle_t handle, security_hash_t hash_type,
                 const uint8_t *input, uint32_t input_len,
                 uint8_t *output, uint32_t *output_len)
{
    stm32_security_ctx_t *ctx = (stm32_security_ctx_t *)handle;
    
    if (!ctx || !ctx->initialized || !input || !output || !output_len ||
        input_len == 0) {
        return -1;
    }
    
    /* 验证输出缓冲区大�?*/
    uint32_t required_size;
    switch (hash_type) {
        case SECURITY_HASH_MD5:
            required_size = 16;
            break;
        case SECURITY_HASH_SHA1:
            required_size = 20;
            break;
        case SECURITY_HASH_SHA224:
            required_size = 28;
            break;
        case SECURITY_HASH_SHA256:
            required_size = 32;
            break;
        case SECURITY_HASH_CRC32:
            required_size = 4;
            break;
        default:
            return -1;
    }
    
    if (*output_len < required_size) {
        return -1;
    }
    
    if (security_lock() != 0) {
        return -1;
    }
    
    int result = 0;
    ctx->status = SECURITY_STATUS_BUSY;
    
    /* 处理特殊的CRC32哈希 */
    if (hash_type == SECURITY_HASH_CRC32) {
        /* 使用STM32 HAL CRC模块计算CRC32 */
        CRC_HandleTypeDef hcrc;
        hcrc.Instance = CRC;
        hcrc.Init.DefaultPolynomialUse = DEFAULT_POLYNOMIAL_ENABLE;
        hcrc.Init.DefaultInitValueUse = DEFAULT_INIT_VALUE_ENABLE;
        hcrc.Init.InputDataInversionMode = CRC_INPUTDATA_INVERSION_NONE;
        hcrc.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_DISABLE;
        hcrc.InputDataFormat = CRC_INPUTDATA_FORMAT_BYTES;
        
        if (HAL_CRC_Init(&hcrc) != HAL_OK) {
            result = -1;
        } else {
            uint32_t crc = HAL_CRC_Calculate(&hcrc, (uint32_t *)input, input_len);
            memcpy(output, &crc, 4);
            *output_len = 4;
            HAL_CRC_DeInit(&hcrc);
        }
    } else {
        /* 配置哈希引擎 */
        if (config_hash_engine(ctx, hash_type) != 0) {
            result = -1;
        } else {
            /* 执行哈希计算 */
            if (HAL_HASH_Start(&ctx->hhash, (uint8_t *)input, input_len, output, TIMEOUT_VALUE) != HAL_OK) {
                result = -1;
            } else {
                *output_len = required_size;
            }
        }
    }
    
    if (result == 0) {
        ctx->status = SECURITY_STATUS_COMPLETE;
    } else {
        ctx->status = SECURITY_STATUS_ERROR;
    }
    
    security_unlock();
    
    /* 调用回调函数 */
    if (ctx->callback) {
        ctx->callback(ctx->callback_arg, ctx->status);
    }
    
    return result;
}

/**
 * @brief 数字签名
 */
int security_sign(security_handle_t handle, uint32_t key_id,
                 const uint8_t *input, uint32_t input_len,
                 uint8_t *signature, uint32_t *sig_len)
{
    stm32_security_ctx_t *ctx = (stm32_security_ctx_t *)handle;
    
    if (!ctx || !ctx->initialized || !input || !signature || !sig_len ||
        input_len == 0) {
        return -1;
    }
    
